// Дан текст. В тексте нужно все пробелы заменить черточками,
// маленькие буквы “к” заменить большими “К”, а большие “С” заменить
// маленькими “с”.
// Ясна ли задача?

// — Я думаю, — сказал князь, улыбаясь, — что,
// ежели бы вас послали вместо нашего милого
// Винценгероде, вы бы взяли приступом согласие
// прусского короля. Вы так красноречивы. Вы
// дадите мне чаю?
string text = "— Я думаю, — сказал князь, улыбаясь, — что,"
          + "ежели бы вас послали вместо нашего милого Винценгероде,"
          + "Вы бы взяли приступом согласие прусского короля."
          + "Вы так красноречивы. Вы дадите мне чаю?";
// пояснения
// string s = "qwerty"
//             012
// s[3] // r

// метод будет принимать строку и менять те символы которые нужно
